app/controllers/labelsheets_controller.rb

SELECT "labelsheets".* FROM "labelsheets"
---
  def index
    @labelsheets = Labelsheet.all

SELECT  "labelsheets".* FROM "labelsheets" WHERE "labelsheets"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @labelsheet = Labelsheet.find(params[:id])

INSERT INTO "labelsheets" ("file_name", "file_uid", "days", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["file_name", "cjdb.xlsx"], ["file_uid", "2016/05/08/2iblgzeq6f_cjdb.xlsx"], ["days", 30], ["created_at", "2016-05-08 17:11:41.206754"], ["updated_at", "2016-05-08 17:11:41.206754"]]
---
  def create
    @labelsheet = Labelsheet.new(labelsheet_params)

    respond_to do |format|
      if @labelsheet.save

UPDATE "labelsheets" SET "file_uid" = $1, "file_name" = $2, "updated_at" = $3 WHERE "labelsheets"."id" = $4  [["file_uid", "2016/05/08/2elvdgq8c7_cjdb_4_19_16.xls"], ["file_name", "cjdb_4-19-16.xls"], ["updated_at", "2016-05-08 18:42:05.278400"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @labelsheet.update(labelsheet_params)

SELECT  "labelsheets".* FROM "labelsheets" WHERE "labelsheets"."id" = $1 LIMIT 1  [["id", 9]]
---
  def set_labelsheet
    @labelsheet = Labelsheet.find(params[:id])