app/controllers/spreadsheets_controller.rb

  def index
    @spreadsheets = Spreadsheet.all
---
SELECT "spreadsheets".* FROM "spreadsheets"

  def show
    @spreadsheet = Spreadsheet.find(params[:id])
---
SELECT  "spreadsheets".* FROM "spreadsheets" WHERE "spreadsheets"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @spreadsheet = Spreadsheet.new(spreadsheet_params)

    respond_to do |format|
      if @spreadsheet.save
---
INSERT INTO "spreadsheets" ("index", "file_name", "file_uid", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["index", ""], ["file_name", "cjdb.xlsx"], ["file_uid", "2016/05/03/74gcq5du5c_cjdb.xlsx"], ["created_at", "2016-05-04 01:32:59.680323"], ["updated_at", "2016-05-04 01:32:59.680323"]]

  def set_spreadsheet
    @spreadsheet = Spreadsheet.find(params[:id])
---
SELECT  "spreadsheets".* FROM "spreadsheets" WHERE "spreadsheets"."id" = $1 LIMIT 1  [["id", 1]]